about/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About Me</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">About Me</h1>
<p>
<i>Hi there fellow hackers, scripters, and computer enthusiasts!</i>
</p>

<p>
My name is Tyler, but online you'll find me going by my alias: <i>Tdback</i>.
</p>

<p>
A little bit about me: to start, I love Linux and am an avid scripter! You'll most often find me hovered over a keyboard writing yet <i>another</i> bash script to automate a boring or tedious task, all so I can get back to doing (in my opinion) more important things like discovering obscure Linux terminal hacks, starting yet another home project, or playing on my Wii and Gamecube emulator, reminiscing in the nostalgia of my favorite childhood games. I absolutely love exploring new technology as well as exploring the rich and oftentimes interesting history of computers and programming.
</p>

<p>
When it comes to the scripting, most of what I write in nowadays comprises of bash scripts, text processing tools like sed, grep, and Awk, the occasional dash of Python for machine learning model development, and now a bit of PowerShell! When I'm not writing scripts to shave seconds off my workflow, I'm oftentimes spending too much time customizing my operating system, Arch Linux, or text editor of choice, Emacs. In fact, this entire website was written using org-mode, an Emacs major mode for keeping notes, writing documents, and generating HTML from markdown-like sytnax (it's org-mode syntax, which in my opinion is superior to that of markdown). If you'd like to know why I choose to use Linux as my operating system, and not Windows, I wrote a blog post about it <a href="../blog/whylinux.html">here</a>!
</p>

<p>
As for the all-important hardware that powers my tech hobbies and endeavors, I mainly use both a desktop that I've built and a MacBook Pro. As for my other boxes, I am currently working on several home server projects. If you want to know more about specifications for the hardware I use, you can find that <a href="../etc/config.html">here</a>.
</p>

<p>
Outside of technology, you can expect to find me brewing teas or trying out new coffees with my great friend Lane (whose site you can find <a href="https://www.lanerj.com/home">here</a>), watching horror movies with my fiancee (80's slashers are by far my favorite, with Scream sitting comfortably at the top of my list), listening to rock music (Breaking Benjamin is the GOAT), playing videogames with the boys, or going for a run to stretch my legs. 
</p>

<div id="outline-container-org8a11676" class="outline-2">
<h2 id="org8a11676">Certifications</h2>
<div class="outline-text-2" id="text-org8a11676">
</div>
<div id="outline-container-orgd5ab510" class="outline-4">
<h4 id="orgd5ab510">Security+</h4>
</div>
<div id="outline-container-org932ed97" class="outline-4">
<h4 id="org932ed97">AWS Certified Cloud Practioner (CCP)</h4>
</div>
<div id="outline-container-orge09d15d" class="outline-4">
<h4 id="orge09d15d">Network+ (in progress)</h4>
</div>
</div>

<div id="outline-container-orgc221225" class="outline-2">
<h2 id="orgc221225">Work Experience</h2>
<div class="outline-text-2" id="text-orgc221225">
</div>
<div id="outline-container-orgd5393fa" class="outline-4">
<h4 id="orgd5393fa">Cyber Security Engineer (Intern) - <i>North Dakota Information Technology (NDIT)</i></h4>
<div class="outline-text-4" id="text-orgd5393fa">
<ul class="org-ul">
<li>January 2023 - PRESENT</li>
<li>Cybersecurity engineering intern on the governance risk and compliance security team.</li>
</ul>
</div>
</div>
<div id="outline-container-org109baa1" class="outline-4">
<h4 id="org109baa1">Desktop Support Technician - <i>Ferris State University</i></h4>
<div class="outline-text-4" id="text-org109baa1">
<ul class="org-ul">
<li>May 2021 - PRESENT</li>
<li>Troubleshooting and configuration of campus technologies and computer maintenance, including: Windows, Mac, Office 365, Active Directory, PrinterLogic, and Cherwell</li>
</ul>
</div>
</div>
<div id="outline-container-org0cd1b3e" class="outline-4">
<h4 id="org0cd1b3e">Teacher Assistant - <i>Ferris State University</i></h4>
<div class="outline-text-4" id="text-org0cd1b3e">
<ul class="org-ul">
<li>August 2022 - March 2022</li>
<li>Python Programming. For two semesters, hosted open labs and helped lead classes to provide assistance and additional instruction for students.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf308285" class="outline-4">
<h4 id="orgf308285">Assistant Instructor - <i>ProKarate</i></h4>
<div class="outline-text-4" id="text-orgf308285">
<ul class="org-ul">
<li>July 2014 - March 2020</li>
<li>Assistant Sensei teaching martial arts to adults and children.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc32907e" class="outline-2">
<h2 id="orgc32907e">Contact Information</h2>
<div class="outline-text-2" id="text-orgc32907e">
<p>
Feel free to reach out to me [at] <code>tylerdback@pm.me</code> if you have any questions about technology, my thoughts on a topic, or just want to talk! Just make sure to mention you viewed my website, or I might mistake you for spam :)
</p>

<p>
You can also find me on <a href="https://www.linkedin.com/in/tyler-dback/">LinkedIn</a>! Feel free to follow me or send me a message, but again, make sure to mention that you viewed my site so I don't mistake you for spam :)
</p>

<p>
And finally, don't forget to check out my <a href="https://github.com/Tdback">GitHub</a>! There you can find all my dotfiles (configuration files for my desktop, laptop, etc.) and any current or past projects I'm working on.
</p>

<p>
<i>Hack away, hack away my friends!</i>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
